## Day 44: Sports Data Analysis 
For this challenge, you are going to use the sports_data 
dataset.

1. Import the sports dataset and write code to check the first 
five rows to confirm that it has loaded properly. Now, using 
the pandas items() method, return all the names of the 
columns that have values of the "object" data type.

In [2]:
import pandas as pd
df = pd.read_csv("sports_data.csv")
df.head()

,Name,Sport,Goals,Assists,Fouls,Minutes Played,Yellow,Red Cards,Team
0,Alex,Basketball,4,5,8,36,1,0,A
1,Bob,Soccer,0,2,1,31,0,0,B
2,Charlie,Basketball,2,2,6,34,1,0,A
3,David,Soccer,1,7,6,9,0,0,B
4,Eve,Basketball,8,2,6,29,0,0,A

In [3]:
columns_names = []

# Looping over the DataFrame
for (columns, values) in df.items():
    if values.dtypes == 'object':
        columns_names.append(columns)

print(columns_names)

['Name', 'Sport', 'Team']

2. Using a pandas method, check the memory size of each 
column using the df.memory_usage() method. Set the deep 
parameter to True. What is the total memory usage of the 
DataFrame in kilobytes?

In [8]:
df.memory_usage(deep = True).sum()/1024

np.float64(4.2060546875)

3. Using pandas convert all the columns with the "object" data 
type to the "categorical" data type. Create a new variable for 
the data frame after the conversation. Check the memory 
size 
of 
the 
resulting 
DataFrame using the 
df.memory_usage() method. Compare your results to the 
results in question 2. What conclusion can you draw?

In [6]:
# Changing the data type from object to category
df2 = df.astype({"Name": "category", "Sport":"category", "Team":"category"})
df2.dtypes

Name              category
Sport             category
Goals                int64
Assists              int64
Fouls                int64
Minutes Played       int64
Yellow               int64
Red Cards            int64
Team              category
dtype: object

In [7]:
df2.memory_usage(deep = True).sum()/1024

np.float64(3.1376953125)

4. Using the pandas method, rename the "Yellow" column to 
"Yellow Cards."

In [9]:
df2 = df2.rename(columns={'Yellow':'Yellow Cards'})
df2.head()

,Name,Sport,Goals,Assists,Fouls,Minutes Played,Yellow Cards,Red Cards,Team
0,Alex,Basketball,4,5,8,36,1,0,A
1,Bob,Soccer,0,2,1,31,0,0,B
2,Charlie,Basketball,2,2,6,34,1,0,A
3,David,Soccer,1,7,6,9,0,0,B
4,Eve,Basketball,8,2,6,29,0,0,A

5. Using the pandas query() method, create a subset 
DataFrame of only players that got over six fouls. Reset 
your index (set it back to the default 0, 1, 2, etc.) and ensure that you remove the index as a column.

In [10]:
# Using query to filter data by fouls 
df3 = df2.query("Fouls > 6").reset_index(drop=True)
df3

,Name,Sport,Goals,Assists,Fouls,Minutes Played,Yellow Cards,Red Cards,Team
0,Alex,Basketball,4,5,8,36,1,0,A
1,George,Basketball,5,8,8,3,1,0,A
2,Harry,Soccer,9,6,8,13,1,0,B
3,Ivan,Basketball,7,9,8,30,1,0,A
4,Katie,Basketball,7,8,9,6,0,0,A
5,Nate,Soccer,0,0,7,44,1,0,B
6,Olivia,Basketball,3,0,8,5,1,0,A

6. Save the new DataFrame as a CSV file. Give it a name of 
your choice.

In [11]:
df3.to_csv("sports_data_modified.csv", index=False)